app/views/workout_sessions/index.html.erb

          <li class="list-group-item">
            <%= Routine.find(ExerciseGroup.find(session.exercise_group_id).routine_id).name %> <br />
---
SELECT  "exercise_groups".* FROM "exercise_groups" WHERE "exercise_groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT 1  [["id", 1]]

            <%= session.date %> <br />
            <% session.workout_exercises.each do |workout_exercise| %>
---
SELECT "workout_exercises".* FROM "workout_exercises" WHERE "workout_exercises"."workout_session_id" = ?  [["workout_session_id", 1]]