app/controllers/exercises_controller.rb

SELECT  "exercise_groups".* FROM "exercise_groups" WHERE "exercise_groups"."id" = ? LIMIT 1  [["id", 2]]
---
  def new
    @exercise_group = ExerciseGroup.find(params[:exercise_group_id])

SELECT  "exercise_groups".* FROM "exercise_groups" WHERE "exercise_groups"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "exercises" ("name", "weight", "weight_increment", "reps_goal", "sets_goal", "time_between_sets", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @exercise_group = ExerciseGroup.find(params[:exercise_group_id])
    @exercise = @exercise_group.exercises.build(exercise_params)
    if @exercise.save

SELECT  "exercise_groups".* FROM "exercise_groups" WHERE "exercise_groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @exercise_group = ExerciseGroup.find(params[:exercise_group_id])
    @exercise = Exercise.find(params[:id])