app/controllers/exercise_groups_controller.rb

SELECT  "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @routine = Routine.find(params[:routine_id])

SELECT  "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "exercise_groups" ("name", "routine_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Day A"], ["routine_id", 7], ["created_at", "2016-11-11 18:19:56.358783"], ["updated_at", "2016-11-11 18:19:56.358783"]]
---
  def create
    @routine = Routine.find(params[:routine_id])
    @exercise_group = @routine.exercise_groups.build(exercise_group_params)
    if @exercise_group.save

SELECT  "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT 1  [["id", 7]]
---
  def add_group
    @routine = Routine.find(params[:routine_id])

SELECT  "exercise_groups".* FROM "exercise_groups" WHERE "exercise_groups"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @exercise_group = ExerciseGroup.find(params[:id])

SELECT  "exercise_groups".* FROM "exercise_groups" WHERE "exercise_groups"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "exercise_groups" SET "name" = ?, "updated_at" = ? WHERE "exercise_groups"."id" = ?  [["name", "Group B2"], ["updated_at", "2016-11-14 19:17:47.949075"], ["id", 3]]
---
  def update
    @exercise_group = ExerciseGroup.find(params[:id])
    if @exercise_group.update_attributes(exercise_group_params)

DELETE FROM "exercise_groups" WHERE "exercise_groups"."id" = ?  [["id", 4]]
SELECT  "exercise_groups".* FROM "exercise_groups" WHERE "exercise_groups"."id" = ? LIMIT 1  [["id", 4]]
---
  def destroy
    ExerciseGroup.find(params[:id]).destroy