app/controllers/routines_controller.rb

  def create
    @routine = current_user.routines.build(routine_params)
    if @routine.save
---
INSERT INTO "routines" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Extra Routine"], ["user_id", 1], ["created_at", "2016-11-01 05:45:38.747669"], ["updated_at", "2016-11-01 05:45:38.747669"]]

  def edit
    @routine = Routine.find(params[:id])
---
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @routine = Routine.find(params[:id])
    if @routine.update_attributes(routine_params)
---
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "routines" SET "name" = ?, "updated_at" = ? WHERE "routines"."id" = ?  [["name", "Phrak's Grey Skill LPG"], ["updated_at", "2016-10-27 21:20:12.826043"], ["id", 1]]

  def destroy
    Routine.find(params[:id]).destroy
---
DELETE FROM "routines" WHERE "routines"."id" = ?  [["id", 5]]
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT 1  [["id", 5]]