app/controllers/routines_controller.rb

SELECT "routines".* FROM "routines"
---
  def index
    @routines = Routine.all