app/controllers/workout_sessions_controller.rb

SELECT "workout_sessions".* FROM "workout_sessions"
---
  def index
    @workout_sessions = WorkoutSession.all

INSERT INTO "workout_sessions" ("date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["date", "2017-01-09 19:05:12.000000"], ["user_id", 1], ["created_at", "2017-01-09 19:05:35.586060"], ["updated_at", "2017-01-09 19:05:35.586060"]]
---
  def create
    @workout_session = current_user.workout_sessions.build(workout_sessions_params)
    if @workout_session.save

SELECT  "workout_sessions".* FROM "workout_sessions" WHERE "workout_sessions"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @workout_session = WorkoutSession.find(params[:id])